[
  {
    "id": "bnz-odapp",
    "date": "2025-01",
    "companyId": "bnz",
    "title": {
      "ko": "오답노트 관리 시스템 개발",
      "en": "Wrong Answer Note Management System Development"
    },
    "shortDesc": {
      "ko": "학생들의 오답을 체계적으로 관리하고 복습할 수 있는 웹 애플리케이션 개발",
      "en": "Developed a web app to help students systematically manage and review their incorrect answers"
    },
    "description": {
      "ko": "오답노트 관리 시스템은 시험을 치른 학생들의 오답을 체계적으로 관리하고, 문제를 마치 일감 관리하듯 한눈에 확인할 수 있게 해주는 서비스입니다. 학생들은 자신의 오답노트를 효율적으로 관리하고, 선생님은 학생들의 진행 상황을 모니터링하며 필요한 피드백을 제공할 수 있습니다. 이 프로젝트는 Next.js, TypeScript, PostgreSQL을 기반으로 개발되었으며, 다양한 사용자 역할과 권한 관리를 지원합니다.",
      "en": "The Wrong Answer Note Management System, or \"Odapp,\" is a service designed to help students organize their exam mistakes systematically and review them at a glance, much like a task management tool. It allows students to efficiently manage their error notes while enabling teachers to track progress and offer timely feedback. Built with Next.js, TypeScript, and PostgreSQL, this project supports multiple user roles and permission management."
    },
    "techStack": [
      "Next.js",
      "TypeScript",
      "PostgreSQL",
      "Prisma",
      "Tailwind CSS",
      "Docker",
      "React Query",
      "Vitest",
      "SSE"
    ],
    "category": ["frontend", "backend", "database"],
    "tasks": {
      "ko": [
        "사용자(학생, 교사, 관리자)별 맞춤형 인터페이스와 권한 관리 시스템을 구현했습니다.",
        "Prisma ORM을 활용한 효율적인 데이터베이스 설계 및 마이그레이션 관리 시스템을 개발했습니다.",
        "저장소 인터페이스를 추상화하여 운영 환경의 실제 데이터를 처리하면서도 동일한 코드 베이스를 유지할 수 있으며, 단위 테스트가 용이해졌습니다.",
        "RESTful API 설계 및 구현으로 프론트엔드와 백엔드 간의 효율적인 통신을 구현했습니다.",
        "자동화된 테스트 환경(Vitest)을 구축하여 코드 품질을 보장했습니다.",
        "프론트엔드의 SSE와 같은 이벤트 핸들러 및 알고리즘 유틸리티를 독립적인 모듈로 추출하여 관심사 분리를 구현했습니다."
      ],
      "en": [
        "Created tailored interfaces and permission management systems for different users, including students, teachers, and admins.",
        "Designed an efficient database and migration management system using Prisma ORM.",
        "Abstracted the repository interface to handle real production data with a consistent codebase, making unit testing easier.",
        "Built RESTful APIs to enable smooth communication between the frontend and backend.",
        "Set up an automated testing environment with Vitest to ensure code quality.",
        "Separated frontend event handlers like Server-Sent Events (SSE) and algorithm utilities into standalone modules for better concern separation."
      ]
    },
    "achievements": {
      "ko": [
        "학생들의 오답 관리 효율성을 높여 학습 성과 개선에 기여했습니다.",
        "교사가 학생들의 문제 풀이 상황을 실시간으로 모니터링할 수 있도록 하여 적시에 피드백을 제공할 수 있게 했습니다.",
        "모듈화된 설계로 새로운 기능 추가와 유지보수가 용이한 시스템을 구축했습니다."
      ],
      "en": [
        "Boosted learning outcomes by streamlining how students manage their incorrect answers.",
        "Allowed teachers to monitor students' problem-solving progress in real-time, enabling timely feedback.",
        "Developed a modular system that makes adding new features and maintenance straightforward."
      ]
    }
  },
  {
    "id": "personal-nextjs-uri-generator",
    "date": "2024-11",
    "companyId": "personal",
    "title": {
      "ko": "Next.js URI 자동 생성기 개발",
      "en": "Next.js URI Generator Development"
    },
    "shortDesc": {
      "ko": "Next.js 앱 라우터 API의 URL을 간편하게 생성하는 VS Code 확장 프로그램",
      "en": "Built a VS Code extension to simplify URL generation for Next.js App Router APIs"
    },
    "description": {
      "ko": "Next.js에서는 파일 경로 기반으로 API 주소가 생성됩니다. 이 방식은 파일 관리는 편리하지만, 현재 작업 중인 파일의 정확한 API 엔드포인트를 즉시 파악하기 어렵습니다. 이 문제를 해결하기 위해 타입스크립트 기반의 URI 생성 확장 프로그램을 개발했습니다. 이 도구는 현재 작업 중인 파일의 API 주소를 즉시 생성해주어 개발 생산성을 크게 향상시킵니다.",
      "en": "Next.js generates API endpoints based on file paths, which is great for managing routes but can make it tricky to instantly pinpoint the exact endpoint for the file you're working on. To tackle this, I created a TypeScript-based URI generator as a VS Code extension. This tool generates the API address for the current file on the spot, significantly boosting development productivity."
    },
    "techStack": ["TypeScript", "Next.js", "Babel", "VS Code Extension API"],
    "category": ["parser"],
    "tasks": {
      "ko": [
        "Next.js의 다양한 라우팅 패턴(App Router/Pages Router)을 분석하여 모든 HTTP 메서드를 자동으로 감지하는 알고리즘 설계",
        "Babel AST 파서를 활용해 모든 유형의 내보내기(export default, export const, export function, export as 등)를 인식하는 정밀한 코드 분석 시스템 구현",
        "효율적인 URL 생성을 위한 유틸리티 함수 개발",
        "VS Code의 Code Lens API를 활용한 직관적인 API 주소 표시 기능 구현"
      ],
      "en": [
        "Designed an algorithm to automatically detect all HTTP methods across Next.js routing patterns, including App Router and Pages Router.",
        "Built a precise code analysis system with the Babel AST parser to identify all export types, like default, const, function, and named exports.",
        "Developed utility functions for efficient URL generation to simplify endpoint access.",
        "Added intuitive API address display using VS Code's Code Lens API."
      ]
    },
    "achievements": {
      "ko": [
        "API 엔드포인트 자동 생성을 통해 개발 과정의 오류를 크게 감소시킴",
        "Babel 기반 AST 분석을 통해 99.5% 이상의 코드 패턴 인식률 달성",
        "API 엔드포인트 자동 생성을 통해 Next.js 프로젝트의 생산성 향상"
      ],
      "en": [
        "Cut down development errors significantly by automating API endpoint generation.",
        "Achieved a code pattern recognition rate of over 99.5% with Babel-based AST analysis.",
        "Increased productivity in Next.js projects through automated API endpoint generation."
      ]
    },
    "sourceUrl": "https://github.com/BearMett/nextjs-url-generator"
  },
  {
    "id": "bnz-latex-hwpx",
    "date": "2024-07",
    "companyId": "bnz",
    "title": {
      "ko": "LaTeX to hwpx 변환기 개발",
      "en": "LaTeX to HWPX Converter Development"
    },
    "shortDesc": {
      "ko": "유사 문제 제공 서비스의 사용자 편의성을 개선하기 위한 LaTeX to hwpx 변환기 개발",
      "en": "Created a LaTeX to HWPX converter to enhance user experience in a similar problem generation service"
    },
    "description": {
      "ko": "사내 서비스에서 제공하는 기능 중 문제를 받아서 유사한 문제를 생성하는 기능이 있습니다. 생성한 문제를 LaTeX와 마크다운 형식으로 제공했으나, 주 사용자인 학원 선생님들의 익숙하지 않은 형식으로 인해 활용도가 낮았습니다. 이를 해결하기 위해 한글 문서 형식으로 자동 변환하여 사용자가 익숙한 환경에서 문제를 수정하고 활용할 수 있도록 소프트웨어를 개발했습니다.",
      "en": "One feature of our internal service generates similar problems based on input problems. While these were originally provided in LaTeX and Markdown formats, they weren't widely used by academy teachers—our main users—due to unfamiliarity. To fix this, I developed software that automatically converts these problems into the Korean HWPX format, letting users edit and work with them in a familiar environment."
    },
    "techStack": ["Python"],
    "category": ["backend", "parser"],
    "tasks": {
      "ko": [
        "마크다운 테이블을 한글과컴퓨터의 XML 데이터 구조에 맞춰 변환하는 파서 모듈을 개발했습니다.",
        "LaTeX 수식을 한글 문서의 자체 수식 형식으로 변환하는 엔진을 구현했습니다.",
        "지속적으로 발견되는 새로운 수식 패턴에 대응하기 위해 변환 알고리즘을 모듈화하고, 단위 테스트를 통해 안정성과 유지보수성을 확보했습니다."
      ],
      "en": [
        "Developed a parser module to convert Markdown tables into the XML structure used by Hangul and Computer (HWP).",
        "Built an engine to transform LaTeX equations into HWP's native equation format.",
        "Modularized the conversion algorithms to adapt to new equation patterns and ensured stability and maintainability with unit tests."
      ]
    },
    "achievements": {
      "ko": [
        "주 고객층인 선생님의 문제 제작 워크플로우가 '캡처 후 붙여넣기'에서 '문서 내에서 직접 수정'으로 개선하여 사용자 편의성을 크게 향상했습니다.",
        "사용자 교육 필요성을 제거하고 즉시 활용 가능한 hwpx 파일 형식을 제공함으로써 서비스 진입 장벽을 낮췄습니다."
      ],
      "en": [
        "Improved the teacher workflow from \"capture and paste\" to direct in-document editing, greatly enhancing usability.",
        "Lowered the entry barrier by providing ready-to-use HWPX files, eliminating the need for user training."
      ]
    },
    "images": [
      {
        "src": "/portfolio/problem-to-hwpx.png",
        "alt": {
          "ko": "hwpx 파일로 변환한 화면",
          "en": "Screenshot of a problem converted to HWPX format"
        }
      },
      {
        "src": "/portfolio/markdown-preview.png",
        "alt": {
          "ko": "LaTex와 수식을 렌더링 한 화면",
          "en": "Screenshot of rendered LaTeX equations"
        }
      }
    ]
  },
  {
    "id": "bnz-mdtex-parser",
    "date": "2024-06",
    "companyId": "bnz",
    "title": {
      "ko": "수학 문제 풀이 솔루션의 텍스트/수식 오류 복구 도구",
      "en": "Text and Equation Error Recovery Tool for Math Solutions"
    },
    "shortDesc": {
      "ko": "LLM이 생성한 수학 풀이에서 수식 구분자 오류를 자동으로 수정하는 파서 개발",
      "en": "Developed a parser to auto-correct equation delimiter errors in LLM-generated math solutions"
    },
    "description": {
      "ko": "수학 문제 풀이를 제공하는 LLM 기반 서비스에서 LaTeX 수식과 마크다운 구문 분석기를 개발했습니다. LLM이 생성한 답변에서 수식 구분자($)가 누락되거나 짝이 맞지 않는 문제가 발생했고, 이는 사용자 화면에 잘못된 내용이 렌더링 되는 심각한 UI 문제를 야기했습니다.",
      "en": "For an LLM-based service providing math problem solutions, I built a parser for LaTeX equations and Markdown syntax. The LLM-generated answers often had missing or mismatched equation delimiters ($), leading to serious UI issues where incorrect content appeared on users' screens."
    },
    "techStack": ["TypeScript", "npm"],
    "category": ["backend", "parser"],
    "tasks": {
      "ko": [
        "문서 요소를 인라인 수식, 블록 수식, 마크다운으로 분류하고 각 요소의 문맥과 속성을 분석하는 파서를 구현했습니다.",
        "블록의 시작과 종료, 수식 포함 여부 등 요소별 속성을 정의하고 잠재적 오류 패턴을 식별하는 로직을 개발했습니다.",
        "각 오류 패턴별 변환 로직을 모듈화하고, 변환 과정의 추적이 가능하도록 설계했습니다.",
        "개별 변환 모듈의 단위 테스트와 전체 파이프라인의 통합 테스트를 구축하여 품질을 보장했습니다."
      ],
      "en": [
        "Created a parser to categorize document elements into inline equations, block equations, and Markdown, analyzing their context and properties.",
        "Developed logic to define element properties—like block boundaries and equation presence—and identify potential error patterns.",
        "Modularized conversion logic for each error pattern, designing it to track the conversion process.",
        "Set up unit tests for individual modules and integration tests for the full pipeline to ensure quality."
      ]
    },
    "achievements": {
      "ko": [
        "내부 테스트 케이스 500건에 대해 100% 성공률을 달성하여 서비스의 안정성을 크게 향상했습니다.",
        "모듈화된 설계로 새로운 오류 패턴 발견 시 기존 기능에 영향을 주지 않고 확장이 가능해졌습니다.",
        "수식 표현 오류로 인한 UI 깨짐 현상이 완전히 해결되어 사용자 경험이 개선되었습니다."
      ],
      "en": [
        "Achieved a 100% success rate across 500 internal test cases, significantly improving service stability.",
        "Enabled easy expansion for new error patterns without impacting existing features thanks to a modular design.",
        "Eliminated UI glitches caused by equation errors, enhancing the user experience."
      ]
    },
    "sourceUrl": "https://github.com/BNZinc/mdtex-parser",
    "images": [
      {
        "src": "/portfolio/correctness-latex.png",
        "alt": {
          "ko": "올바르게 수정된 LaTeX 구문",
          "en": "Correctly fixed LaTeX syntax"
        }
      },
      {
        "src": "/portfolio/borken-latex.png",
        "alt": {
          "ko": "사용자에게 잘못 표시되는 LaTeX 구문",
          "en": "LaTeX syntax displayed incorrectly to users"
        }
      }
    ]
  },
  {
    "id": "bnz-vector-search",
    "date": "2024-05",
    "companyId": "bnz",
    "title": {
      "ko": "학생 질문 유사 문제 검색 벡터 파이프라인 구축",
      "en": "Vector Pipeline for Similar Problem Search Based on Student Questions"
    },
    "shortDesc": {
      "ko": "임베딩 기반 유사 문제 검색 시스템 개발로 질문-문제 연결성 강화",
      "en": "Built an embedding-based search system to better connect questions with similar problems"
    },
    "description": {
      "ko": "선생님들의 유사 문제 검색 니즈를 해결하기 위해 임베딩 기반 검색 시스템을 구축했습니다. 기존 키워드 분류와 출처 검색 방식은 인력 부족으로 실현이 어려웠으나, 팀 내 개념 증명을 통해 임베딩과 벡터 검색 기반의 새로운 접근 방식을 도입했습니다.",
      "en": "To meet teachers' needs for finding similar problems, I developed an embedding-based search system. Traditional keyword and source-based searches were impractical due to limited manpower, so I introduced a new approach using embeddings and vector search, validated through a team proof of concept."
    },
    "techStack": ["TypeScript", "Azure OpenAI", "Elastic Search"],
    "category": ["backend", "search", "ai", "database"],
    "tasks": {
      "ko": [
        "Elastic Search를 활용하여 하이브리드 검색 시스템을 구축했습니다. 키워드 검색과 벡터 검색을 결합하여 검색 정확도를 향상했습니다.",
        "OCR로 추출한 텍스트를 토큰화하여 효율적인 키워드 검색 기능을 구현했습니다.",
        "Azure OpenAI의 임베딩 모델을 활용하여 512차원 벡터 검색을 구현했으며, 적절한 정확도의 유사도 매칭을 달성했습니다.",
        "개발 환경의 접근성을 높이기 위해 Elastic Search 환경을 컨테이너화하여 로컬 개발 설정을 간소화했습니다."
      ],
      "en": [
        "Built a hybrid search system with Elastic Search, blending keyword and vector searches to improve accuracy.",
        "Tokenized OCR-extracted text for efficient keyword search functionality.",
        "Used Azure OpenAI's embedding model for 512-dimensional vector search, achieving reliable similarity matching.",
        "Containerized Elastic Search to streamline local development setup and improve accessibility."
      ]
    },
    "achievements": {
      "ko": [
        "임베딩 기반 검색으로 별도의 데이터 가공 없이 효율적인 유사 문제 검색 시스템을 구축했습니다.",
        "검색 서비스와 임베딩 로직을 모듈화하여 Azure OpenAI 외 다른 임베딩 서비스로의 전환이 용이한 아키텍처를 설계했습니다."
      ],
      "en": [
        "Created an efficient similar problem search system using embeddings, no extra data processing required.",
        "Designed a modular architecture for search and embedding logic, making it easy to switch from Azure OpenAI to other embedding services."
      ]
    }
  },
  {
    "id": "bnz-boilerplate",
    "date": "2024-05",
    "companyId": "bnz",
    "title": {
      "ko": "교육 서비스 보일러플레이트 프로젝트 작성",
      "en": "Educational Service Boilerplate Project"
    },
    "shortDesc": {
      "ko": "교육 도메인을 위한 표준화된 기술 스택과 아키텍처 구성",
      "en": "Standardized tech stack and architecture for educational services"
    },
    "description": {
      "ko": "교육 서비스의 핵심 도메인(학원, 질문, 답변, 교재)을 모듈화한 보일러플레이트 프로젝트를 개발했습니다. 이를 통해 신규 교육 관련 프로젝트 시작 시 참조할 수 있는 표준 아키텍처와 도메인 구현체를 제공했습니다.",
      "en": "I built a boilerplate project that modularizes key educational domains like academies, questions, answers, and textbooks. This offers a standard architecture and domain implementation for kickstarting new education-related projects."
    },
    "techStack": ["NextJS", "NestJS", "Expo", "GitHub Actions", "PostgreSQL"],
    "category": ["backend", "frontend", "database", "devops"],
    "tasks": {
      "ko": [
        "NestJS를 활용하여 DDD 기반의 도메인 중심 아키텍처를 설계했으며, 각 도메인의 비즈니스 규칙을 명확히 분리했습니다.",
        "개발자 경험 향상을 위해 OpenAPI 문서 자동화, 구조화된 로깅 시스템, 테스트 자동화 파이프라인을 구축했습니다.",
        "GitHub Actions를 활용하여 프론트엔드, 백엔드, 모바일 앱의 CI/CD 파이프라인을 구축하고, GCP 기반 인프라 자동화를 구현했습니다."
      ],
      "en": [
        "Designed a domain-driven architecture with NestJS, clearly separating business rules for each domain.",
        "Enhanced developer experience with automated OpenAPI docs, a structured logging system, and a test automation pipeline.",
        "Set up CI/CD pipelines for frontend, backend, and mobile apps using GitHub Actions, plus GCP-based infrastructure automation."
      ]
    },
    "achievements": {
      "ko": [
        "교육 도메인의 표준 구현체를 제공하여 신규 프로젝트의 초기 개발 시간을 단축하고 일관된 아키텍처 적용이 가능해졌습니다.",
        "자동화된 배포 파이프라인 구축으로 개발팀의 운영 부담을 크게 감소시켰으며, 배포 프로세스의 안정성을 향상했습니다."
      ],
      "en": [
        "Provided a standard implementation for educational domains, cutting initial development time and ensuring consistent architecture.",
        "Reduced the dev team's operational load and stabilized deployment with automated pipelines."
      ]
    }
  },
  {
    "id": "bnz-domain-refactoring",
    "date": "2024-04",
    "companyId": "bnz",
    "title": {
      "ko": "교육 서비스 도메인 정리 및 운영 기능 구축",
      "en": "Educational Service Domain Refactoring and Operations Setup"
    },
    "shortDesc": {
      "ko": "서비스 안정성과 유지보수성 향상을 위한 아키텍처 재설계",
      "en": "Redesigned architecture for better stability and maintainability"
    },
    "description": {
      "ko": "교육 질의응답 플랫폼 '하이큐썸'의 시스템 구조를 개선하는 프로젝트를 수행했습니다. 서비스 확장으로 인한 시스템 복잡도 증가와 연쇄적 오류 발생 문제를 해결하기 위해 아키텍처를 재설계했습니다.",
      "en": "I worked on improving the system structure of 'HiQ-Sum,' an educational Q&A platform. The project tackled growing complexity and cascading errors from service expansion by redesigning the architecture."
    },
    "techStack": ["NodeJS", "React", "GCP AppEngine", "GCP Function", "GCP CloudBuild"],
    "category": ["backend", "devops", "database", "refactoring"],
    "tasks": {
      "ko": [
        "기능들을 회원, 문제, 푸시 알림 등 도메인 단위로 분리하여 모듈화했습니다.",
        "핵심 기능 간의 의존성을 분석하고 서비스 레이어를 재구성하여 유지보수성을 향상했습니다.",
        "중복 코드를 제거하고 공통 기능을 추출하여 코드베이스를 최적화했습니다.",
        "자동화된 테스트 환경을 구축하고 테스트 커버리지를 0%에서 50%까지 증가시켰습니다.",
        "GCP, Sentry, Slack 기반의 실시간 오류 모니터링 시스템을 구축하여 장애 대응 체계를 강화했습니다."
      ],
      "en": [
        "Split features into modular domains like members, problems, and push notifications.",
        "Analyzed core feature dependencies and restructured the service layer for better maintainability.",
        "Optimized the codebase by removing duplicates and extracting shared functions.",
        "Built an automated testing setup, raising test coverage from 0% to 50%.",
        "Set up real-time error monitoring with GCP, Sentry, and Slack to improve issue response."
      ]
    },
    "achievements": {
      "ko": [
        "테스트 커버리지를 0%에서 50%까지 개선했습니다.",
        "버그 수정 소요 시간을 2주에서 2일로 대폭 단축하여 서비스 안정성을 크게 향상했습니다.",
        "사전 모니터링 체계 구축으로 잠재적 문제를 조기에 발견하고 대응할 수 있게 되었습니다."
      ],
      "en": [
        "Boosted test coverage from 0% to 50%.",
        "Slashed bug fix time from two weeks to two days, greatly improving service stability.",
        "Enabled early issue detection and response with a proactive monitoring system."
      ]
    }
  },
  {
    "id": "buttersoft-carbon-credit-exchange",
    "date": "2024-03",
    "companyId": "buttersoft",
    "title": {
      "ko": "카본몬스터 백엔드 시스템 (거래소 엔진) 개발",
      "en": "Carbon Monster Backend System (Exchange Engine) Development"
    },
    "shortDesc": {
      "ko": "NFT 거래 플랫폼의 고성능 주문 매칭 엔진 개발",
      "en": "Built a high-performance order matching engine for an NFT trading platform"
    },
    "description": {
      "ko": "카본몬스터는 탄소 배출권을 NFT로 토큰화하여 거래할 수 있는 플랫폼입니다. 이 프로젝트에서는 NestJS를 기반으로 확장 가능한 백엔드 아키텍처를 설계 및 구현했으며, 특히 Red-Black Tree 자료구조를 활용한 고성능 주문 매칭 엔진을 개발했습니다. 도메인 주도 설계(DDD) 원칙을 적용하여 복잡한 비즈니스 로직을 명확하게 구조화하고, 마이크로서비스 아키텍처를 통해 각 기능의 독립적인 확장이 가능하도록 구현했습니다.",
      "en": "Carbon Monster is a platform that tokenizes carbon credits as NFTs for trading. For this project, I designed and implemented a scalable backend architecture using NestJS, including a high-performance order matching engine powered by a Red-Black Tree data structure. By applying Domain-Driven Design (DDD) principles, I structured complex business logic clearly, and used a microservices architecture to enable independent scaling of each feature."
    },
    "techStack": ["NestJS", "TypeScript", "MySQL", "Redis", "Docker", "WebSocket", "TypeORM", "AWS S3"],
    "category": ["backend", "database"],
    "tasks": {
      "ko": [
        "확장 가능한 거래 시스템을 위한 전체 프로젝트 구조 설계",
        "Red-Black Tree 자료구조를 활용한 효율적인 주문 매칭 엔진 개발",
        "각 종목별로 독립적으로 확장 가능한 수직 확장 아키텍처 설계",
        "도메인 주도 설계(DDD) 원칙을 적용한 비즈니스 로직 구현",
        "RESTful API 및 WebSocket을 통한 실시간 주문 처리 시스템 개발",
        "마이크로서비스 아키텍처의 효율적인 통신을 위한 이벤트 기반 메시징 시스템 구현"
      ],
      "en": [
        "Designed the overall project structure for a scalable trading system.",
        "Developed an efficient order matching engine using a Red-Black Tree data structure.",
        "Created a vertically scalable architecture for independent scaling per trading item.",
        "Implemented business logic following Domain-Driven Design (DDD) principles.",
        "Built a real-time order processing system with RESTful APIs and WebSocket.",
        "Set up an event-based messaging system for efficient microservices communication."
      ]
    },
    "achievements": {
      "ko": [
        "Red-Black Tree 알고리즘을 활용하여 주문 매칭 시 O(log n)의 시간 복잡도를 달성하여 거래 처리 성능 향상",
        "종목별 독립적 실행이 가능한 아키텍처로 시스템 확장성 및 안정성 확보",
        "도메인 주도 설계를 통해 복잡한 비즈니스 로직을 명확하게 구조화하여 유지보수성 향상",
        "이벤트 기반 아키텍처를 통한 마이크로서비스 간 효율적인 통신 구현"
      ],
      "en": [
        "Achieved O(log n) time complexity for order matching with Red-Black Tree, boosting trade performance.",
        "Ensured scalability and stability with an architecture supporting independent execution per item.",
        "Improved maintainability by clearly structuring complex business logic with DDD.",
        "Enabled efficient microservices communication through an event-based architecture."
      ]
    }
  },
  {
    "id": "maxst-tlona",
    "date": "2023-08",
    "companyId": "maxst",
    "title": {
      "ko": "메타버스 플랫폼 '틀로나' 웹서버 개발",
      "en": "'TLONA' Metaverse Platform Web Server Development"
    },
    "shortDesc": {
      "ko": "현실 기반 월드와 소셜 기능을 제공하는 메타버스 백엔드 구현",
      "en": "Developed a metaverse backend with real-world-based environments and social features"
    },
    "description": {
      "ko": "\"틀로나\"는 현실 세계를 기반으로 한 메타버스 플랫폼으로, 사용자가 가상 공간과 토지를 소유하고 다른 사용자들과 소통 할 수 있습니다. 플랫폼 내에서 NFT 토지 거래와 공간 개발을 통해 콘텐츠 제공자로 활동할 수 있습니다. 저는 메타버스 경험의 핵심 요소인 회원 관리, 가상 아이템 상점, 토지 소유권 관리 등의 기반 시스템을 개발하고 이를 API로 제공했습니다.",
      "en": "\"TLONA\" is a metaverse platform rooted in the real world, where users can own virtual spaces and land, and interact with others. It allows users to become content creators through NFT land trades and space development. I developed core systems like member management, a virtual item shop, and land ownership management, delivering them via APIs."
    },
    "techStack": ["NestJS", "Bitbucket", "Bitbucket Pipeline", "AWS S3", "AWS ECS"],
    "category": ["backend", "cloud", "database"],
    "tasks": {
      "ko": [
        "파트장으로서 기획팀과 긴밀히 소통하며 개발 방향을 정립하고, 이를 팀원들에게 명확하게 전달했습니다.",
        "상점, 우편함, 인벤토리, 지갑, 토지 관리 등 핵심 기능을 도메인 중심으로 설계하고 구현했습니다.",
        "핵심 기능의 안정성 확보를 위해 단위 테스트를 구축했습니다.",
        "실시간 모니터링 시스템을 도입하여 팀원들이 이슈를 신속하게 감지하고 대응할 수 있도록 했습니다."
      ],
      "en": [
        "As team lead, I collaborated closely with planners to shape development direction and communicated it clearly to the team.",
        "Designed and implemented key features like shops, mailboxes, inventories, wallets, and land management with a domain-centric approach.",
        "Built unit tests to ensure the stability of core features.",
        "Introduced real-time monitoring so the team could quickly spot and address issues."
      ]
    },
    "achievements": {
      "ko": [
        "도메인 설계 도입 후, 팀원들의 작업 브랜치 병합 주기가 7일 이상에서 1-2일로 단축되었습니다.",
        "2주간의 클로즈 베타 테스트 동안 웹 서버 로직 관련 버그 리포트가 0건으로 유지되었습니다."
      ],
      "en": [
        "Reduced team branch merge cycles from over 7 days to 1-2 days after adopting domain design.",
        "Kept web server logic bug reports at zero during a two-week closed beta test."
      ]
    }
  },
  {
    "id": "maxst-local-server",
    "date": "2023-05",
    "companyId": "maxst",
    "title": {
      "ko": "틀로나 독립 서버 환경 실행 자동화",
      "en": "TLONA Independent Server Automation"
    },
    "shortDesc": {
      "ko": "컨테이너 기반 로컬 개발 및 테스트 환경 구축",
      "en": "Set up a container-based local dev and test environment"
    },
    "description": {
      "ko": "개발 과정에서 기획자들의 잦은 데이터 수정 요청으로 인해 개발 서버가 불안정해지는 문제가 발생했습니다. 이를 해결하기 위해 다른 팀 개발자가 CSV 파일을 통한 데이터 수정 기능을 구현했고, 저는 각 팀원이 독립적으로 개발 서버를 운영할 수 있도록 컨테이너화를 진행했습니다.",
      "en": "Frequent data change requests from planners during development destabilized the server. To address this, another developer added a CSV-based data modification feature, while I containerized the setup so each team member could run an independent dev server."
    },
    "techStack": ["Docker", "Bash", "NodeJS"],
    "category": ["devops", "backend"],
    "tasks": {
      "ko": [
        "실시간 멀티플레이어 동기화 서버, 비동기 웹서버, 데이터베이스, 캐시 시스템을 컨테이너화했습니다.",
        "컨테이너 실행 시 로컬 CSV 파일을 읽어 독립적인 서버 환경을 구성하는 자동화 스크립트를 개발했습니다.",
        "팀 내 '로컬 서버' 기능의 도입 목적을 공유하고, 상세한 사용 매뉴얼을 작성했습니다."
      ],
      "en": [
        "Containerized the real-time multiplayer sync server, async web server, database, and cache system.",
        "Wrote automation scripts to read local CSV files and set up independent server environments on container startup.",
        "Explained the purpose of the \"local server\" feature to the team and created a detailed usage guide."
      ]
    },
    "achievements": {
      "ko": [
        "기획자들이 독립된 환경에서 자유롭게 데이터를 수정하고 테스트할 수 있게 되었습니다.",
        "개발팀이 기획팀의 데이터 수정 요청 처리에 투입되는 시간을 절감했습니다."
      ],
      "en": [
        "Enabled planners to freely modify and test data in isolated environments.",
        "Saved the dev team time on handling planners' data change requests."
      ]
    }
  },
  {
    "id": "wv-migration",
    "date": "2022-09",
    "companyId": "wearvalley",
    "title": {
      "ko": "경쟁사 제품의 DB 접근제어 정책 이관",
      "en": "Migration of Competitor DB Access Control Policies"
    },
    "shortDesc": {
      "ko": "대규모 보안 정책의 자동화된 분석 및 이관 시스템 구축",
      "en": "Developed an automated system for analyzing and migrating large-scale security policies"
    },
    "description": {
      "ko": "대기업 고객사가 경쟁사 제품에서 자사 제품으로 전환하면서, 약 2천대의 데이터베이스에 적용된 5천여 개의 보안 정책을 이관해야 하는 상황이 발생했습니다. 정책의 규모가 수동 이관이 불가능한 수준이었기 때문에, 데이터 분석을 통한 자동화된 정책 생성 솔루션이 필요했습니다.",
      "en": "When a major client switched from a competitor's product to ours, we needed to migrate around 5,000 security policies across 2,000 databases. The sheer volume made manual migration impossible, so I built an automated solution using data analysis to generate the policies."
    },
    "techStack": ["CentOS", "SQL", "Lua"],
    "category": ["backend", "database", "security"],
    "tasks": {
      "ko": [
        "망분리 환경의 고객사 시스템에서 샘플 데이터를 추출하여 이관 프로그램의 프로토타입을 개발했고, 이후 현장에서 실제 이관 프로그램을 구현했습니다.",
        "경쟁사 제품의 데이터 구조를 분석하고 자사 제품의 정책 체계에 맞게 재해석했으며, 도출된 매핑 로직을 고객사와 지속적으로 검증했습니다.",
        "개발된 이관 프로그램과 상세 운영 매뉴얼을 현장 엔지니어에게 인계하고, 이후 발생하는 패치 요청과 모니터링을 지원했습니다."
      ],
      "en": [
        "Extracted sample data from the client's network-separated system to prototype a migration program, later implementing it on-site.",
        "Analyzed the competitor's data structure, adapted it to our policy system, and continuously validated the mapping logic with the client.",
        "Handed over the migration program and a detailed manual to field engineers, supporting subsequent patches and monitoring."
      ]
    },
    "achievements": {
      "ko": [
        "약 2,000대의 데이터베이스에 적용된 5,000여 개의 접근 제어 정책을 성공적으로 이관했습니다.",
        "기존 정책과 새로운 정책 간의 매핑 검증 쿼리를 개발하여 100% 이관 완료를 입증했습니다."
      ],
      "en": [
        "Successfully migrated over 5,000 access control policies across roughly 2,000 databases.",
        "Developed verification queries to confirm 100% migration accuracy between old and new policies."
      ]
    }
  },
  {
    "id": "wv-cc",
    "date": "2022-03",
    "companyId": "wearvalley",
    "title": {
      "ko": "샤크라맥스 V4의 보안적합성검증(CC) 인증",
      "en": "ChakraMax V4 Common Criteria (CC) Certification"
    },
    "shortDesc": {
      "ko": "국가 보안 인증을 위한 시스템 개발 및 검증",
      "en": "Developed and verified a system for national security certification"
    },
    "description": {
      "ko": "보안 제품을 공공기관에 납품하려면 CC 인증이 필요합니다. 이에 따라 새로운 제품의 개발 마지막 단계에서 CC 인증을 진행했습니다. 인증 평가 항목에는 프로그램 덤프 생성 시 비밀 정보가 평문으로 남아있는지, 검증된 암호화 알고리즘을 사용하는지, OS 의존성을 최소화한 상태에서 동작할 수 있는지, 키 관리를 안전하게 수행하는지 등이 포함되며, 다양한 측면에서 평가가 이루어졌습니다.",
      "en": "To supply security products to public institutions, Common Criteria (CC) certification is required. I handled this certification in the final stages of developing a new product, addressing evaluation criteria like ensuring no plaintext secrets in program dumps, using verified encryption algorithms, minimizing OS dependencies, and securing key management."
    },
    "techStack": ["CentOS", "C", "C++", "Makefile", "Bash", "Jenkins"],
    "category": ["backend", "security", "devops"],
    "tasks": {
      "ko": [
        "OS 독립적인 데몬 관리를 위해 자체 데몬 컨트롤러를 C/C++로 개발하여 systemctl 의존성을 제거했습니다.",
        "Jenkins를 활용해 빌드 완료 시 폐쇄망의 공통 테스트 서버에 자동으로 설치되는 CI/CD 파이프라인을 구축했습니다.",
        "시큐어 코딩 기준을 충족하기 위해 비밀 정보 메모리의 안전한 할당과 해제를 보장하는 메모리 관리 루틴을 구현했습니다."
      ],
      "en": [
        "Built a custom daemon controller in C/C++ for OS-independent management, eliminating systemctl reliance.",
        "Set up a Jenkins CI/CD pipeline to auto-deploy builds to a closed-network test server.",
        "Implemented memory management routines to securely allocate and free secret data, meeting secure coding standards."
      ]
    },
    "achievements": {
      "ko": [
        "자동화된 배포 파이프라인 구축으로 QA 팀의 빌드 설치 시간을 기존 대비 크게 단축했습니다.",
        "OS 의존성이 없는 데몬 관리 시스템 개발로 제품의 호환성과 보안성을 향상했습니다.",
        "모든 보안 요구사항을 충족하여 최종적으로 CC 인증을 획득했습니다."
      ],
      "en": [
        "Cut QA build installation time significantly with an automated deployment pipeline.",
        "Enhanced compatibility and security with an OS-independent daemon management system.",
        "Met all security requirements to secure CC certification."
      ]
    }
  },
  {
    "id": "wv-personnel-integration",
    "date": "2021-06",
    "companyId": "wearvalley",
    "title": {
      "ko": "고객사 인사정보-사용자 정보 연동 솔루션",
      "en": "Client HR and User Info Integration Solution"
    },
    "shortDesc": {
      "ko": "대기업 맞춤형 인사 데이터 통합 및 자동화 시스템",
      "en": "Custom HR data integration and automation for large enterprises"
    },
    "description": {
      "ko": "고객사의 인사 정보를 자사 제품의 사용자 계정과 연동하는 커스터마이징 프로그램을 개발했습니다. 각 고객사별로 특정 부서 사용자 동기화, 휴직자 계정 비활성화 등 다양한 요구사항이 있었으며, 이를 위해 요건 분석부터 개발, 배포, 운영까지 전체 프로세스를 담당했습니다.",
      "en": "I developed a custom program to sync client HR data with our product's user accounts. Each client had unique needs—like syncing specific departments or deactivating accounts on leave—so I managed the full process from requirements analysis to development, deployment, and operations."
    },
    "techStack": ["CentOS", "Lua", "SQL"],
    "category": ["backend", "database", "integration"],
    "tasks": {
      "ko": [
        "고객사별 맞춤형 인사 연동 요구사항을 분석하고 최적화된 연동 프로그램을 개발했습니다.",
        "기존 운영 중인 연동 프로그램의 유지보수와 기술 지원을 수행했습니다.",
        "망분리 환경에서 발생하는 연동 이슈를 분석하고, 현장 엔지니어를 위한 기술 지원을 제공했습니다.",
        "고객사별 인사 연동 요건과 구현 방식을 문서화했습니다."
      ],
      "en": [
        "Analyzed and built optimized integration programs tailored to each client's HR needs.",
        "Maintained and supported existing integration programs in operation.",
        "Troubleshot integration issues in network-separated environments and assisted field engineers.",
        "Documented HR integration requirements and implementations per client."
      ]
    },
    "achievements": {
      "ko": [
        "인사 연동 솔루션 제공을 통해 고객사별 커스터마이징 및 유지보수 계약으로 추가 수익을 창출했습니다.",
        "연동 프로그램 개발 경험과 기술 지원 내용을 체계적으로 문서화하여 사내 지식 베이스를 구축했으며, 이를 통해 유사 프로젝트의 효율적인 수행이 가능해졌습니다."
      ],
      "en": [
        "Generated extra revenue through client-specific customization and maintenance contracts via HR integration.",
        "Created an internal knowledge base by documenting development and support experiences, streamlining similar projects."
      ]
    }
  }
]