{
  "id": "bnz-domain-refactoring",
  "date": "2024-04",
  "companyId": "bnz",
  "title": {
    "ko": "교육 서비스 도메인 정리 및 운영 기능 구축",
    "en": "Educational Service Domain Refactoring and Operations Setup"
  },
  "shortDesc": {
    "ko": "서비스 안정성과 유지보수성 향상을 위한 아키텍처 재설계",
    "en": "Redesigned architecture for better stability and maintainability"
  },
  "description": {
    "ko": "교육 질의응답 플랫폼 '하이큐썸'의 시스템 구조를 개선하는 프로젝트를 수행했습니다. 서비스 확장으로 인한 시스템 복잡도 증가와 연쇄적 오류 발생 문제를 해결하기 위해 아키텍처를 재설계했습니다.",
    "en": "I worked on improving the system structure of 'HiQ-Sum,' an educational Q&A platform. The project tackled growing complexity and cascading errors from service expansion by redesigning the architecture."
  },
  "techStack": [
    "NodeJS",
    "React",
    "GCP AppEngine",
    "GCP Function",
    "GCP CloudBuild"
  ],
  "category": [
    "backend",
    "devops",
    "database",
    "refactoring"
  ],
  "tasks": {
    "ko": [
      "기능들을 회원, 문제, 푸시 알림 등 도메인 단위로 분리하여 모듈화했습니다.",
      "핵심 기능 간의 의존성을 분석하고 서비스 레이어를 재구성하여 유지보수성을 향상했습니다.",
      "중복 코드를 제거하고 공통 기능을 추출하여 코드베이스를 최적화했습니다.",
      "자동화된 테스트 환경을 구축하고 테스트 커버리지를 0%에서 50%까지 증가시켰습니다.",
      "GCP, Sentry, Slack 기반의 실시간 오류 모니터링 시스템을 구축하여 장애 대응 체계를 강화했습니다."
    ],
    "en": [
      "Split features into modular domains like members, problems, and push notifications.",
      "Analyzed core feature dependencies and restructured the service layer for better maintainability.",
      "Optimized the codebase by removing duplicates and extracting shared functions.",
      "Built an automated testing setup, raising test coverage from 0% to 50%.",
      "Set up real-time error monitoring with GCP, Sentry, and Slack to improve issue response."
    ]
  },
  "achievements": {
    "ko": [
      "테스트 커버리지를 0%에서 50%까지 개선했습니다.",
      "버그 수정 소요 시간을 2주에서 2일로 대폭 단축하여 서비스 안정성을 크게 향상했습니다.",
      "사전 모니터링 체계 구축으로 잠재적 문제를 조기에 발견하고 대응할 수 있게 되었습니다."
    ],
    "en": [
      "Boosted test coverage from 0% to 50%.",
      "Slashed bug fix time from two weeks to two days, greatly improving service stability.",
      "Enabled early issue detection and response with a proactive monitoring system."
    ]
  }
}