{
  "id": "personal-nextjs-uri-generator",
  "date": "2024-11",
  "companyId": "personal",
  "title": {
    "ko": "Next.js URI 자동 생성기 개발",
    "en": "Next.js URI Generator Development"
  },
  "shortDesc": {
    "ko": "Next.js 앱 라우터 API의 URL을 간편하게 생성하는 VS Code 확장 프로그램",
    "en": "Built a VS Code extension to simplify URL generation for Next.js App Router APIs"
  },
  "description": {
    "ko": "Next.js에서는 파일 경로 기반으로 API 주소가 생성됩니다. 이 방식은 파일 관리는 편리하지만, 현재 작업 중인 파일의 정확한 API 엔드포인트를 즉시 파악하기 어렵습니다. 이 문제를 해결하기 위해 타입스크립트 기반의 URI 생성 확장 프로그램을 개발했습니다. 이 도구는 현재 작업 중인 파일의 API 주소를 즉시 생성해주어 개발 생산성을 크게 향상시킵니다.",
    "en": "Next.js generates API endpoints based on file paths, which is great for managing routes but can make it tricky to instantly pinpoint the exact endpoint for the file you're working on. To tackle this, I created a TypeScript-based URI generator as a VS Code extension. This tool generates the API address for the current file on the spot, significantly boosting development productivity."
  },
  "techStack": [
    "TypeScript",
    "Next.js",
    "Babel",
    "VS Code Extension API"
  ],
  "category": [
    "parser"
  ],
  "tasks": {
    "ko": [
      "Next.js의 다양한 라우팅 패턴(App Router/Pages Router)을 분석하여 모든 HTTP 메서드를 자동으로 감지하는 알고리즘 설계",
      "Babel AST 파서를 활용해 모든 유형의 내보내기(export default, export const, export function, export as 등)를 인식하는 정밀한 코드 분석 시스템 구현",
      "효율적인 URL 생성을 위한 유틸리티 함수 개발",
      "VS Code의 Code Lens API를 활용한 직관적인 API 주소 표시 기능 구현"
    ],
    "en": [
      "Designed an algorithm to automatically detect all HTTP methods across Next.js routing patterns, including App Router and Pages Router.",
      "Built a precise code analysis system with the Babel AST parser to identify all export types, like default, const, function, and named exports.",
      "Developed utility functions for efficient URL generation to simplify endpoint access.",
      "Added intuitive API address display using VS Code's Code Lens API."
    ]
  },
  "achievements": {
    "ko": [
      "API 엔드포인트 자동 생성을 통해 개발 과정의 오류를 크게 감소시킴",
      "Babel 기반 AST 분석을 통해 99.5% 이상의 코드 패턴 인식률 달성",
      "API 엔드포인트 자동 생성을 통해 Next.js 프로젝트의 생산성 향상"
    ],
    "en": [
      "Cut down development errors significantly by automating API endpoint generation.",
      "Achieved a code pattern recognition rate of over 99.5% with Babel-based AST analysis.",
      "Increased productivity in Next.js projects through automated API endpoint generation."
    ]
  },
  "sourceUrl": "https://github.com/BearMett/nextjs-url-generator"
}