{
  "id": "slk-version-control-setup",
  "date": "2025-03",
  "companyId": "slk",
  "title": {
    "ko": "20년 레거시 15개 저장소 통합으로 개발 속도 향상",
    "en": "Improved Development Speed by Consolidating 15 Legacy Repositories"
  },
  "shortDesc": {
    "ko": "15개 SVN 저장소를 Git으로 통합하고 PHP 5.3→5.6, Apache→Nginx 전환으로 개발 효율 대폭 향상",
    "en": "Consolidated 15 SVN repositories to Git and migrated PHP 5.3→5.6, Apache→Nginx for major efficiency gains"
  },
  "description": {
    "ko": "20년 경과한 PHP 5.3 교육 플랫폼이 유료/테스트/무료 3개 버전 × 학생/모바일/관리자/선생님/공통 5개 모듈로 분리되어 총 15개 SVN 저장소로 관리되고 있었습니다. FTP 수동 배포로 재해 복구가 불가능했고, 두 명 이상의 개발자가 같은 파일을 수정하면 나중에 업로드한 사람의 코드만 남는 문제가 반복되어 유지보수 비용이 과다하게 발생했습니다.",
    "en": "A 20-year-old PHP 5.3 education platform was split into 15 SVN repositories across 3 versions (paid/test/free) × 5 modules (student/mobile/admin/teacher/common). Manual FTP deployment made disaster recovery impossible, and when multiple developers modified the same file, only the last upload survived—causing repeated code loss and excessive maintenance costs."
  },
  "techStack": [
    "PHP 5.6",
    "Nginx",
    "PHP-FPM",
    "MySQL 5.6",
    "Git",
    "Docker",
    "Shell Script"
  ],
  "category": [
    "backend",
    "devops",
    "database",
    "refactoring"
  ],
  "tasks": {
    "ko": [
      "15개 분산 SVN 저장소를 분석하여 단일 Git 저장소로 통합하고, 도메인별 분기 로직을 추상화",
      "FTP 기반 수정을 차단하고 Git 형상 관리 체계로 전환하여 모든 변경사항을 추적 가능하도록 구성",
      "PHP 5.3과 5.6 양쪽에서 동작 가능한 코드 상태를 유지하면서 점진적 마이그레이션 수행",
      "성능 개선을 위해 PHP 5.3/Apache2에서 PHP 5.6/Nginx+PHP-FPM으로 전환",
      "현대화된 스택으로 개발 서버를 구축하고 실제 복구 시나리오 테스트로 재해복구 가능성 검증"
    ],
    "en": [
      "Analyzed 15 distributed SVN repositories and consolidated into single Git repository with abstracted domain branching logic",
      "Blocked FTP-based modifications and transitioned to Git version control to make all changes traceable",
      "Maintained code compatibility with both PHP 5.3 and 5.6 during gradual migration",
      "Migrated from PHP 5.3/Apache2 to PHP 5.6/Nginx+PHP-FPM for performance improvement",
      "Built development servers with modernized stack and tested actual recovery scenarios to validate disaster recovery"
    ]
  },
  "achievements": {
    "ko": [
      "코드 중복 70% 제거: 15개 저장소에 분산된 중복 코드를 단일 추상화 모듈로 통합",
      "신규 기능 개발 시간 66% 단축: 3가지 버전에 각각 적용하던 작업을 하나의 모듈로 처리",
      "1시간 내 재해 복구 체계 확립: 복구 불가능했던 서비스를 복구 가능한 상태로 전환",
      "긴급 패치 대응 시간 90% 단축: 전체 버전 동시 배포 가능해져 빠른 대응 가능",
      "Nginx 도입으로 Apache 대비 30% 성능 향상 및 동시 접속 처리 개선"
    ],
    "en": [
      "70% code duplication eliminated: Consolidated duplicate code across 15 repositories into single abstraction module",
      "66% reduction in new feature development time: Tasks previously applied to 3 versions now handled by single module",
      "Disaster recovery within 1 hour established: Transformed unrecoverable service into recoverable state",
      "90% reduction in emergency patch response time: Simultaneous deployment across all versions enabled fast response",
      "30% performance improvement over Apache with Nginx adoption and improved concurrent connection handling"
    ]
  }
}
