{
  "id": "slk-content-management-system",
  "date": "2025-06",
  "companyId": "slk",
  "title": {
    "ko": "사업팀 자립화 - 컨텐츠 관리 시스템(CMS) 구축",
    "en": "Business Team Independence - Content Management System (CMS) Development"
  },
  "shortDesc": {
    "ko": "개발팀 운영 부담 80% 감소, 컨텐츠 등록 시간 95% 단축을 달성한 통합 CMS 구축",
    "en": "Integrated CMS achieving 80% reduction in dev team burden and 95% faster content registration"
  },
  "description": {
    "ko": "사업팀의 컨텐츠 등록에 DBeaver, SFTP 등 개발 도구가 필요했습니다. 데이터 오류 우려로 개발팀 검증 프로세스로 변질되어 컨텐츠 반영까지 3~5일이 소요되었습니다. JSON 포맷 오류, 미디어 경로 불일치 등 문제가 빈발하여 개발팀이 항상 개입해야 했고, 사업팀은 독립적으로 업무를 수행할 수 없었습니다.",
    "en": "The business team needed developer tools like DBeaver and SFTP to register content. Due to data error concerns, it became a development team verification process, taking 3-5 days for content deployment. JSON format errors and media path mismatches occurred frequently, requiring constant dev team intervention and preventing the business team from working independently."
  },
  "techStack": [
    "Next.js",
    "React",
    "TypeScript",
    "PostgreSQL",
    "Prisma",
    "NCP Object Storage"
  ],
  "category": [
    "frontend",
    "backend",
    "database"
  ],
  "tasks": {
    "ko": [
      "사업팀 인터뷰를 통한 요구사항 분석 및 UX 설계",
      "Next.js 기반 직관적 관리 도구 구현, CSV 템플릿 제공 및 실시간 스키마 검증",
      "NCP 연동 통합 파일 관리 서비스로 SFTP 수작업 완전 제거",
      "JSON 포맷 사전 검증 및 에러 메시지 한글화로 비개발자 사용성 극대화"
    ],
    "en": [
      "Requirements analysis and UX design through business team interviews",
      "Implemented intuitive management tool with Next.js, CSV templates, and real-time schema validation",
      "Completely eliminated SFTP manual work with NCP-integrated file management service",
      "Maximized non-developer usability with JSON format pre-validation and Korean error messages"
    ]
  },
  "achievements": {
    "ko": [
      "개발팀 운영 부담 80% 감소: 사업팀이 개발팀 도움 없이 독립적으로 콘텐츠 관리 가능",
      "컨텐츠 등록 시간 95% 단축: 3~5일 소요되던 작업이 즉시 완료로 변경",
      "신규 운영팀원도 별도 교육 없이 즉시 실무 투입 가능",
      "파일 경로 오류로 인한 서빙 실패 문제 완전 해결"
    ],
    "en": [
      "80% reduction in dev team operational burden: Business team can manage content independently without dev help",
      "95% reduction in content registration time: Tasks taking 3-5 days now complete immediately",
      "New operations team members can start production work immediately without separate training",
      "Completely resolved file serving failures due to file path errors"
    ]
  }
}
