{
  "id": "wv-migration",
  "date": "2022-09",
  "companyId": "wearvalley",
  "title": {
    "ko": "경쟁사 제품의 DB 접근제어 정책 이관",
    "en": "Migration of Competitor DB Access Control Policies"
  },
  "shortDesc": {
    "ko": "대규모 보안 정책의 자동화된 분석 및 이관 시스템 구축",
    "en": "Developed an automated system for analyzing and migrating large-scale security policies"
  },
  "description": {
    "ko": "대기업 고객사가 경쟁사 제품에서 자사 제품으로 전환하면서, 약 2천대의 데이터베이스에 적용된 5천여 개의 보안 정책을 이관해야 하는 상황이 발생했습니다. 정책의 규모가 수동 이관이 불가능한 수준이었기 때문에, 데이터 분석을 통한 자동화된 정책 생성 솔루션이 필요했습니다.",
    "en": "When a major client switched from a competitor's product to ours, we needed to migrate around 5,000 security policies across 2,000 databases. The sheer volume made manual migration impossible, so I built an automated solution using data analysis to generate the policies."
  },
  "techStack": [
    "CentOS",
    "SQL",
    "Lua"
  ],
  "category": [
    "backend",
    "database",
    "security"
  ],
  "tasks": {
    "ko": [
      "망분리 환경의 고객사 시스템에서 샘플 데이터를 추출하여 이관 프로그램의 프로토타입을 개발했고, 이후 현장에서 실제 이관 프로그램을 구현했습니다.",
      "경쟁사 제품의 데이터 구조를 분석하고 자사 제품의 정책 체계에 맞게 재해석했으며, 도출된 매핑 로직을 고객사와 지속적으로 검증했습니다.",
      "개발된 이관 프로그램과 상세 운영 매뉴얼을 현장 엔지니어에게 인계하고, 이후 발생하는 패치 요청과 모니터링을 지원했습니다."
    ],
    "en": [
      "Extracted sample data from the client's network-separated system to prototype a migration program, later implementing it on-site.",
      "Analyzed the competitor's data structure, adapted it to our policy system, and continuously validated the mapping logic with the client.",
      "Handed over the migration program and a detailed manual to field engineers, supporting subsequent patches and monitoring."
    ]
  },
  "achievements": {
    "ko": [
      "약 2,000대의 데이터베이스에 적용된 5,000여 개의 접근 제어 정책을 성공적으로 이관했습니다.",
      "기존 정책과 새로운 정책 간의 매핑 검증 쿼리를 개발하여 100% 이관 완료를 입증했습니다."
    ],
    "en": [
      "Successfully migrated over 5,000 access control policies across roughly 2,000 databases.",
      "Developed verification queries to confirm 100% migration accuracy between old and new policies."
    ]
  }
}