{
  "id": "wv-migration",
  "date": "2022-09",
  "companyId": "wearvalley",
  "title": {
    "ko": "경쟁사 제품의 DB 접근제어 정책 이관",
    "en": "Migration of Competitor DB Access Control Policies"
  },
  "shortDesc": {
    "ko": "대규모 보안 정책의 자동화된 분석 및 이관 시스템 구축",
    "en": "Developed an automated system for analyzing and migrating large-scale security policies"
  },
  "description": {
    "ko": "대기업 고객사가 경쟁사 제품에서 자사 제품으로 전환하면서, 약 2천대의 데이터베이스에 적용된 5천여 개의 보안 정책을 이관해야 하는 상황이 발생했습니다. 정책의 규모가 수동 이관이 불가능한 수준이었기 때문에, 데이터 분석을 통한 자동화된 정책 생성 솔루션이 필요했습니다.",
    "en": "When a major client switched from a competitor's product to ours, we needed to migrate around 5,000 security policies across 2,000 databases. The sheer volume made manual migration impossible, so I built an automated solution using data analysis to generate the policies."
  },
  "techStack": [
    "CentOS",
    "SQL",
    "Lua"
  ],
  "category": [
    "backend",
    "database",
    "security"
  ],
  "tasks": {
    "ko": [
      "고객사의 망분리 환경에서는 외부 접근이 불가능하여 원격 개발이 불가능했으므로, 샘플 데이터를 추출하여 프로토타입을 먼저 개발하고 이후 현장에서 실제 이관 프로그램을 구현하는 2단계 접근법을 적용했습니다.",
      "경쟁사와 자사 제품의 정책 체계가 달라 단순 복사로는 이관이 불가능했으므로, 경쟁사 제품의 데이터 구조를 분석하고 자사 제품의 정책 체계에 맞게 재해석하는 매핑 로직을 개발했습니다.",
      "현장 엔지니어가 이관 프로그램을 직접 운영해야 했으므로, 개발된 이관 프로그램과 상세 운영 매뉴얼을 인계하고 이후 발생하는 패치 요청과 모니터링을 지원했습니다."
    ],
    "en": [
      "External access was impossible in the client's network-separated environment, making remote development unfeasible, so I applied a two-stage approach: first developing a prototype with extracted sample data, then implementing the actual migration program on-site.",
      "Simple copying was impossible because the competitor's and our product's policy systems differed, so I developed mapping logic by analyzing the competitor's data structure and reinterpreting it to fit our policy system.",
      "Field engineers needed to operate the migration program directly, so I handed over the developed migration program with a detailed operation manual and supported subsequent patch requests and monitoring."
    ]
  },
  "achievements": {
    "ko": [
      "수동으로는 수개월이 소요됐을 5,000여 개의 접근 제어 정책을 자동화된 이관 프로그램으로 단기간에 완료하여, 대기업 고객사의 경쟁사 제품에서 자사 제품으로의 전환을 성공적으로 지원했습니다.",
      "매핑 검증 쿼리로 100% 이관 완료를 입증하여 보안 정책의 연속성을 보장했고, 보안 공백 없이 안전하게 제품을 전환할 수 있었습니다."
    ],
    "en": [
      "Completed migration of over 5,000 access control policies—which would have taken months manually—in a short period using an automated migration program, successfully supporting a major enterprise client's transition from a competitor's product to ours.",
      "Verified 100% migration completion through mapping validation queries, ensuring security policy continuity and enabling a safe product transition without security gaps."
    ]
  }
}