{
  "id": "wv-personnel-integration",
  "date": "2021-06",
  "companyId": "wearvalley",
  "title": {
    "ko": "고객사 인사정보-사용자 정보 연동 솔루션",
    "en": "Client HR and User Info Integration Solution"
  },
  "shortDesc": {
    "ko": "대기업 맞춤형 인사 데이터 통합 및 자동화 시스템",
    "en": "Custom HR data integration and automation for large enterprises"
  },
  "description": {
    "ko": "고객사의 인사 정보를 자사 제품의 사용자 계정과 연동하는 커스터마이징 프로그램을 개발했습니다. 각 고객사별로 특정 부서 사용자 동기화, 휴직자 계정 비활성화 등 다양한 요구사항이 있었으며, 이를 위해 요건 분석부터 개발, 배포, 운영까지 전체 프로세스를 담당했습니다.",
    "en": "I developed a custom program to sync client HR data with our product's user accounts. Each client had unique needs—like syncing specific departments or deactivating accounts on leave—so I managed the full process from requirements analysis to development, deployment, and operations."
  },
  "techStack": [
    "CentOS",
    "Lua",
    "SQL"
  ],
  "category": [
    "backend",
    "database",
    "integration"
  ],
  "tasks": {
    "ko": [
      "고객사 DB 접근 관리자와 직접 인터뷰하여 사용자 라이프사이클 관리 요구사항 파악 (계정 추가/비활성화/제거 시점)",
      "대화를 통해 단순 기능 요청 이면의 보안 감사 요건과 내부 규정 발견 및 이해",
      "고객사별 차별화된 정책 구현 (예: A사 - 퇴사자 즉시 삭제, B사 - 임시 그룹 이동 후 수동 처리)",
      "고객사별 코드베이스 개발 및 형상 관리를 통한 맞춤형 솔루션 제공",
      "연동 프로그램 유지보수 및 기술 지원 지속 제공"
    ],
    "en": [
      "Directly interviewed client DB access managers to understand user lifecycle management requirements (account addition/deactivation/removal timing)",
      "Discovered and understood security audit requirements and internal regulations behind simple feature requests through conversation",
      "Implemented differentiated policies per client (e.g., Company A - immediate deletion upon resignation, Company B - move to temporary group for manual processing)",
      "Provided customized solutions through client-specific codebase development and configuration management",
      "Provided ongoing maintenance and technical support for integration programs"
    ]
  },
  "achievements": {
    "ko": [
      "고객사별 보안 정책과 규정을 충족하는 안정적인 인사 연동 시스템 구축",
      "안정적인 운영으로 고객사 신뢰 확보",
      "맞춤형 솔루션 제공을 통한 추가 수익 창출 기여",
      "고객사 요구사항 대응 역량 확보"
    ],
    "en": [
      "Built stable HR integration systems meeting each client's security policies and regulations",
      "Secured client trust through stable operations",
      "Contributed to additional revenue generation through customized solution provision",
      "Developed capability to respond to client requirements"
    ]
  }
}